## Terraform Plan 📋

## 📊 Plan Analysis Results
| Metric | Count |
|--------|-------|
| 🏗️ Resources Changed | 82 |
| ➕ Create | 36 |
| 🔄 Update | 1 |
| 🗑️ Delete | 2 |
| 🔁 Replace | 2 |


⚠️ **ATTENTION REQUIRED**
🗑️ This plan includes **2** deletion(s) - review carefully

🔁 This plan includes **2** replacement(s) - review carefully



📈 **Large Change Detected**
This plan modifies **82** resources (threshold: 10)

✅ **Plan Analysis Passed** - No critical issues detected


<details>
<summary>Show Full Plan</summary>

```hcl
module.eks_cluster.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/ml-platform-dev/cluster]
module.security.data.aws_caller_identity.current: Reading...
module.container_registry.aws_ecr_repository.this: Refreshing state... [id=ml-platform-api]
module.eks_cluster.module.eks.data.aws_partition.current[0]: Reading...
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] (deposed object 625f0d07): Refreshing state... [id=ml-platform-dev:ml-platform-dev-ng-20251109235917169100000014]
module.networking.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.networking.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.eks_cluster.aws_iam_role.node_group: Refreshing state... [id=ml-platform-dev-ng-20251109234831515300000003]
module.eks_cluster.module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_cluster.module.eks.data.aws_caller_identity.current[0]: Reading...
module.networking.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.eks_cluster.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.networking.data.aws_region.current: Reading...
module.eks_cluster.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.networking.module.vpc.data.aws_region.current[0]: Reading...
module.networking.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.networking.module.vpc.data.aws_partition.current[0]: Reading...
module.networking.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-west-2]
module.networking.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0bc0f1b3d869d4a7e]
module.networking.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_cluster.module.eks.aws_iam_role.this[0]: Refreshing state... [id=ml-platform-dev-cluster-20251109234831512900000001]
module.networking.module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20251109234831514000000002]
module.security.data.aws_caller_identity.current: Read complete after 0s [id=984479408136]
module.networking.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=984479408136]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_eks_worker_node_policy: Refreshing state... [id=ml-platform-dev-ng-20251109234831515300000003/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_ec2_container_registry_read_only: Refreshing state... [id=ml-platform-dev-ng-20251109234831515300000003/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_eks_cni_policy: Refreshing state... [id=ml-platform-dev-ng-20251109234831515300000003/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_ssm_managed_instance_core[0]: Refreshing state... [id=ml-platform-dev-ng-20251109234831515300000003/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
module.eks_cluster.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=ml-platform-dev-cluster-20251109234831512900000001/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
module.eks_cluster.module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=984479408136]
module.eks_cluster.module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks_cluster.module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::984479408136:assumed-role/GitHubActions-AssumeRoleForActions/GitHubActions-TF-Plan-20227859693]
module.container_registry.aws_ecr_lifecycle_policy.this: Refreshing state... [id=ml-platform-api]
module.networking.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-039edcf95c8c76402]
module.networking.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-04c4abccff2449f7f]
module.networking.aws_security_group.vpc_endpoints: Refreshing state... [id=sg-02ab99f737571dc25]
module.networking.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d499d5c977654e28]
module.networking.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-01a0a67d7af63e9c3]
module.networking.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0df1e4697248c3649]
module.networking.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e51079c00abcde29]
module.networking.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-058dc1431ef95abc6]
module.networking.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-04b042dba5b15d3dd]
module.networking.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0bdb37ef9940a0e99]
module.networking.module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-0bc0f1b3d869d4a7e]
module.networking.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0bfe9d5be65243edf]
module.eks_cluster.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-04464eed4a2edb62a]
module.networking.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0725660086a41cdd6]
module.networking.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-051b745d54aab57a9]
module.eks_cluster.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0b6291eb591ae62e2]
module.networking.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.networking.module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-019ddc445893b827b]
module.networking.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2746461713]
module.networking.module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::984479408136:policy/vpc-flow-log-to-cloudwatch-20251109234845621800000009]
module.networking.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-016789ff8435ccde6]
module.networking.module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20251109234831514000000002/arn:aws:iam::984479408136:policy/vpc-flow-log-to-cloudwatch-20251109234845621800000009]
module.networking.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e03f31de31136f61]
module.networking.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-00bd3900c9f3ea6b9]
module.networking.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0acb6b7e569046e1b]
module.networking.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0312a95ec67c5598d]
module.networking.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09c663d8aa5f879ee]
module.networking.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-051b745d54aab57a91080289494]
module.networking.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b2880cd80d1f8264]
module.eks_cluster.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3405179778]
module.eks_cluster.module.eks.aws_security_group_rule.cluster["egress_nodes_ephemeral_ports_tcp"]: Refreshing state... [id=sgrule-1752656920]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_self_all"]: Refreshing state... [id=sgrule-3186315972]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_dns_udp"]: Refreshing state... [id=sgrule-3132356804]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_node_ports"]: Refreshing state... [id=sgrule-1210787376]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_cluster_to_node_all_traffic"]: Refreshing state... [id=sgrule-543352375]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1319934072]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_ntp"]: Refreshing state... [id=sgrule-3542202381]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-542544616]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-2818148273]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_kubelet"]: Refreshing state... [id=sgrule-394074273]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_dns_tcp"]: Refreshing state... [id=sgrule-1142500432]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2215194887]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3843188895]
module.networking.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0f54b4c2f0bd54e9a]
module.networking.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0725660086a41cdd61080289494]
module.eks_cluster.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=ml-platform-dev]
module.networking.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0e9f2ad3266aa0407]
module.networking.aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-0ed521e06ba567229]
module.networking.aws_vpc_endpoint.sts: Refreshing state... [id=vpce-09a0016a3c414489a]
module.networking.aws_vpc_endpoint.ec2: Refreshing state... [id=vpce-0fac51ee2575444bb]
module.networking.aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-04f2280ff1e04391b]
module.networking.aws_vpc_endpoint.autoscaling: Refreshing state... [id=vpce-0d6f33a47b317f29f]
module.eks_cluster.module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0c111259719936999,Environment]
module.eks_cluster.module.eks.aws_ec2_tag.cluster_primary_security_group["Cluster"]: Refreshing state... [id=sg-0c111259719936999,Cluster]
module.eks_cluster.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::984479408136:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/6183887E9D57324A6160F8C248235ABC]
module.eks_cluster.module.eks.time_sleep.this[0]: Refreshing state... [id=2025-11-09T23:59:10Z]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].data.aws_ssm_parameter.ami[0]: Reading...
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=7663277169175040379]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_launch_template.this[0]: Refreshing state... [id=lt-0360ddd0721a472b4]
module.eks_cluster.aws_iam_role.ebs_csi_driver[0]: Refreshing state... [id=ml-platform-dev-ebs-csi-20251109235841247200000011]
module.eks_cluster.aws_iam_role_policy_attachment.ebs_csi_driver[0]: Refreshing state... [id=ml-platform-dev-ebs-csi-20251109235841247200000011/arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].data.aws_ssm_parameter.ami[0]: Read complete after 0s [id=/aws/service/eks/optimized-ami/1.34/amazon-linux-2023/x86_64/standard/recommended/release_version]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0]: Refreshing state... [id=ml-platform-dev:ml-platform-dev-ng-20251110075939177800000001]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks_cluster.module.eks.aws_eks_cluster.this[0] has been deleted
  - resource "aws_eks_cluster" "this" {
      - arn                           = "arn:aws:eks:us-west-2:984479408136:cluster/ml-platform-dev" -> null
      - certificate_authority         = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJYkFlTEg4cG9KRWd3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TlRFeE1Ea3lNelE1TXpsYUZ3MHpOVEV4TURjeU16VTBNemxhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUQxKzVrcHRPSllKa1QvaEtCV3djdTVuMGxLYmxtbWwxcC9Va1JtakVVdXB4ZURhd01SS0ozNDIxN3kKbTUwcEtkcnA0TlFOakxhd21IVVcxQ1JCWWVIeVEwQkdlaCtsUG9kV1dZVmJoajRUdGdaV05FYXNlMVpZUmgrQwpJYnMyR2ZNT0wxUklZSlppYUNoRlI1VFk0cmFLdVdGUitEbmlrNlhGeWx3bGExdTFadm9sTVdGM3gvS0RBZW5aCnZPQ1RJYWNOa2xDeUt3eEoyNERTL1JpVVpib2R1U2dzOUhWRFBGazJUUFA0VHVzQm9BamlDSzNhK0w3dzVVc3kKN3ZHdElUVlZVZFVoZUhtd1NWVmZUamFWUm5lc2tCUW12eVk5RXRNNEkwMnFlTUI3WFRzbW1teStwaUFjTSs0YQpKd3ByN0dSdkdFRCs1cHFyVGQ1MFM5UDZCa0xUQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRdmREQnp1L3llNWgwRE9Qa21vb2ozblYrWHVEQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQWR2MW9wOFl1NAowZ3d2ZysvMVNFbjB0cFlZcStVSmlmSjRkTHhOWkxKR01nUTNPYWJWb2dVM1c2dFMyNEc5d0RXNUd4V1A1dVpvCjBEQzFhZ0JsZjRkdGVhWDU1ZlMvdkpZbFo0Uit3TmxiaHkyWHVPVXNsYUMwaXVERWU1RjJwRWhWUGphQml3STQKMnQvOTIvK2xtTTFQcWhVdlZ6dmlyYnd3bzhoUzlaRGxYNWxsckduNjVldzNpQ1M4MzNkd2tFTC96UGcwL3J1TwpJTFEzSXFMZmlkWGhjR05ma1VpeE5HN1FET3RUa3dPYUtPejdyMjBLWEloQnBnSFZHSGY0aWNZNVgrU2t2SEtVCkRIazAzS0xvUFFIbGowNzNGeEpHRGRiMFFsTEJKOHE1R2VVS0hBR01NWWRBelN0TFNicWVDY3JwZTNTRDA2K2oKQkc2SUlvQkdZMVgwCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> null
      - endpoint                      = "https://6183887E9D57324A6160F8C248235ABC.gr7.us-west-2.eks.amazonaws.com" -> null
      - id                            = "ml-platform-dev" -> null
      - identity                      = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-west-2.amazonaws.com/id/6183887E9D57324A6160F8C248235ABC"
                    },
                ]
            },
        ] -> null
      - name                          = "ml-platform-dev" -> null
      - platform_version              = "eks.7" -> null
      - status                        = "ACTIVE" -> null
        tags                          = {
            "Cluster"               = "ml-platform-dev"
            "Environment"           = "dev"
            "terraform-aws-modules" = "eks"
        }
      - version                       = "1.34" -> null
        # (7 unchanged attributes hidden)

      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "172.20.0.0/16" -> null
            # (1 unchanged attribute hidden)

          - elastic_load_balancing {
              - enabled = false -> null
            }
        }

      - vpc_config {
          - cluster_security_group_id = "sg-0c111259719936999" -> null
            # (6 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.networking.module.vpc.aws_internet_gateway.this[0] has been deleted
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:us-west-2:984479408136:internet-gateway/igw-0bfe9d5be65243edf" -> null
      - id       = "igw-0bfe9d5be65243edf" -> null
        tags     = {
            "Cluster"     = "ml-platform-dev"
            "Environment" = "dev"
            "Name"        = "ml-platform-dev-vpc"
        }
        # (4 unchanged attributes hidden)
    }

  # module.networking.module.vpc.aws_route.public_internet_gateway[0] has been deleted
  - resource "aws_route" "public_internet_gateway" {
      - id                          = "r-rtb-051b745d54aab57a91080289494" -> null
        # (19 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] has been deleted
  - resource "aws_eks_node_group" "this" {
      - id                     = "ml-platform-dev:ml-platform-dev-ng-20251110075939177800000001" -> null
        tags                   = {
            "Cluster"     = "ml-platform-dev"
            "Environment" = "dev"
            "Name"        = "ml-platform-dev-ng"
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_launch_template.this[0] has been deleted
  - resource "aws_launch_template" "this" {
      - arn                                  = "arn:aws:ec2:us-west-2:984479408136:launch-template/lt-0360ddd0721a472b4" -> null
      - default_version                      = 1 -> null
      - id                                   = "lt-0360ddd0721a472b4" -> null
      - latest_version                       = 1 -> null
      - name                                 = "main-20251109235911319800000012" -> null
        tags                                 = {
            "Cluster"     = "ml-platform-dev"
            "Environment" = "dev"
            "Name"        = "ml-platform-dev-worker-node"
        }
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks_cluster.data.aws_iam_policy_document.ebs_csi_driver_assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ebs_csi_driver_assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:ebs-csi-controller-sa",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.eks_cluster.aws_iam_role.ebs_csi_driver[0] will be updated in-place
  ~ resource "aws_iam_role" "ebs_csi_driver" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-west-2.amazonaws.com/id/6183887E9D57324A6160F8C248235ABC:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-west-2.amazonaws.com/id/6183887E9D57324A6160F8C248235ABC:sub" = "system:serviceaccount:kube-system:ebs-csi-controller-sa"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::984479408136:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/6183887E9D57324A6160F8C248235ABC"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "ml-platform-dev-ebs-csi-20251109235841247200000011"
        name                  = "ml-platform-dev-ebs-csi-20251109235841247200000011"
        tags                  = {
            "Cluster"     = "ml-platform-dev"
            "Environment" = "dev"
            "Name"        = "ml-platform-dev-ebs-csi-driver"
        }
        # (11 unchanged attributes hidden)
    }

  # module.networking.aws_vpc_endpoint.autoscaling will be created
  + resource "aws_vpc_endpoint" "autoscaling" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + region                = "us-west-2"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-02ab99f737571dc25",
        ]
      + service_name          = "com.amazonaws.us-west-2.autoscaling"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-autoscaling-endpoint"
        }
      + tags_all              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-autoscaling-endpoint"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0bc0f1b3d869d4a7e"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.networking.aws_vpc_endpoint.ec2 will be created
  + resource "aws_vpc_endpoint" "ec2" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + region                = "us-west-2"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-02ab99f737571dc25",
        ]
      + service_name          = "com.amazonaws.us-west-2.ec2"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-ec2-endpoint"
        }
      + tags_all              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-ec2-endpoint"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0bc0f1b3d869d4a7e"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.networking.aws_vpc_endpoint.ecr_api will be created
  + resource "aws_vpc_endpoint" "ecr_api" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + region                = "us-west-2"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-02ab99f737571dc25",
        ]
      + service_name          = "com.amazonaws.us-west-2.ecr.api"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-ecr-api-endpoint"
        }
      + tags_all              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-ecr-api-endpoint"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0bc0f1b3d869d4a7e"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.networking.aws_vpc_endpoint.ecr_dkr will be created
  + resource "aws_vpc_endpoint" "ecr_dkr" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + region                = "us-west-2"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-02ab99f737571dc25",
        ]
      + service_name          = "com.amazonaws.us-west-2.ecr.dkr"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-ecr-dkr-endpoint"
        }
      + tags_all              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-ecr-dkr-endpoint"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0bc0f1b3d869d4a7e"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.networking.aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                          + "s3:ListBucket",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = [
                          + "arn:aws:s3:::prod-us-west-2-starport-layer-bucket",
                          + "arn:aws:s3:::prod-us-west-2-starport-layer-bucket/*",
                        ]
                    },
                  + {
                      + Action      = "s3:*"
                      + Effect      = "Deny"
                      + NotResource = [
                          + "arn:aws:s3:::prod-us-west-2-starport-layer-bucket",
                          + "arn:aws:s3:::prod-us-west-2-starport-layer-bucket/*",
                        ]
                      + Principal   = {
                          + AWS = "*"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = (known after apply)
      + region                = "us-west-2"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-west-2.s3"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-s3-endpoint"
        }
      + tags_all              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-s3-endpoint"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-0bc0f1b3d869d4a7e"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.networking.aws_vpc_endpoint.sts will be created
  + resource "aws_vpc_endpoint" "sts" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + region                = "us-west-2"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-02ab99f737571dc25",
        ]
      + service_name          = "com.amazonaws.us-west-2.sts"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-sts-endpoint"
        }
      + tags_all              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-sts-endpoint"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0bc0f1b3d869d4a7e"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks_cluster.module.eks.aws_ec2_tag.cluster_primary_security_group["Cluster"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Cluster"
      + region      = "us-west-2"
      + resource_id = (known after apply)
      + value       = "ml-platform-dev"
    }

  # module.eks_cluster.module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Environment"
      + region      = "us-west-2"
      + resource_id = (known after apply)
      + value       = "dev"
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + service_account_role_arn    = "arn:aws:iam::984479408136:role/ml-platform-dev-ebs-csi-20251109235841247200000011"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = false
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + deletion_protection           = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "ml-platform-dev"
      + platform_version              = (known after apply)
      + region                        = "us-west-2"
      + role_arn                      = "arn:aws:iam::984479408136:role/ml-platform-dev-cluster-20251109234831512900000001"
      + status                        = (known after apply)
      + tags                          = {
          + "Cluster"               = "ml-platform-dev"
          + "Environment"           = "dev"
          + "terraform-aws-modules" = "eks"
        }
      + tags_all                      = {
          + "Cluster"               = "ml-platform-dev"
          + "Environment"           = "dev"
          + "ManagedBy"             = "Terraform"
          + "Owner"                 = "wlevan3"
          + "Project"               = "ml-platform-engineering-practicum"
          + "terraform-aws-modules" = "eks"
        }
      + version                       = "1.34"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = false
        }

      + compute_config (known after apply)

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)

          + elastic_load_balancing (known after apply)
        }

      + storage_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "127.0.0.1/32",
            ]
          + security_group_ids        = [
              + "sg-0b6291eb591ae62e2",
            ]
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks_cluster.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] must be replaced
-/+ resource "aws_iam_openid_connect_provider" "oidc_provider" {
      ~ arn             = "arn:aws:iam::984479408136:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/6183887E9D57324A6160F8C248235ABC" -> (known after apply)
      ~ id              = "arn:aws:iam::984479408136:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/6183887E9D57324A6160F8C248235ABC" -> (known after apply)
        tags            = {
            "Cluster"     = "ml-platform-dev"
            "Environment" = "dev"
            "Name"        = "ml-platform-dev-eks-irsa"
        }
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
      ~ url             = "oidc.eks.us-west-2.amazonaws.com/id/6183887E9D57324A6160F8C248235ABC" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.eks_cluster.module.eks.time_sleep.this[0] must be replaced
+/- resource "time_sleep" "this" {
      ~ id              = "2025-11-09T23:59:10Z" -> (known after apply)
      ~ triggers        = { # forces replacement
          ~ "certificate_authority_data" = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJYkFlTEg4cG9KRWd3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TlRFeE1Ea3lNelE1TXpsYUZ3MHpOVEV4TURjeU16VTBNemxhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUQxKzVrcHRPSllKa1QvaEtCV3djdTVuMGxLYmxtbWwxcC9Va1JtakVVdXB4ZURhd01SS0ozNDIxN3kKbTUwcEtkcnA0TlFOakxhd21IVVcxQ1JCWWVIeVEwQkdlaCtsUG9kV1dZVmJoajRUdGdaV05FYXNlMVpZUmgrQwpJYnMyR2ZNT0wxUklZSlppYUNoRlI1VFk0cmFLdVdGUitEbmlrNlhGeWx3bGExdTFadm9sTVdGM3gvS0RBZW5aCnZPQ1RJYWNOa2xDeUt3eEoyNERTL1JpVVpib2R1U2dzOUhWRFBGazJUUFA0VHVzQm9BamlDSzNhK0w3dzVVc3kKN3ZHdElUVlZVZFVoZUhtd1NWVmZUamFWUm5lc2tCUW12eVk5RXRNNEkwMnFlTUI3WFRzbW1teStwaUFjTSs0YQpKd3ByN0dSdkdFRCs1cHFyVGQ1MFM5UDZCa0xUQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRdmREQnp1L3llNWgwRE9Qa21vb2ozblYrWHVEQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQWR2MW9wOFl1NAowZ3d2ZysvMVNFbjB0cFlZcStVSmlmSjRkTHhOWkxKR01nUTNPYWJWb2dVM1c2dFMyNEc5d0RXNUd4V1A1dVpvCjBEQzFhZ0JsZjRkdGVhWDU1ZlMvdkpZbFo0Uit3TmxiaHkyWHVPVXNsYUMwaXVERWU1RjJwRWhWUGphQml3STQKMnQvOTIvK2xtTTFQcWhVdlZ6dmlyYnd3bzhoUzlaRGxYNWxsckduNjVldzNpQ1M4MzNkd2tFTC96UGcwL3J1TwpJTFEzSXFMZmlkWGhjR05ma1VpeE5HN1FET3RUa3dPYUtPejdyMjBLWEloQnBnSFZHSGY0aWNZNVgrU2t2SEtVCkRIazAzS0xvUFFIbGowNzNGeEpHRGRiMFFsTEJKOHE1R2VVS0hBR01NWWRBelN0TFNicWVDY3JwZTNTRDA2K2oKQkc2SUlvQkdZMVgwCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)
          ~ "endpoint"                   = "https://6183887E9D57324A6160F8C248235ABC.gr7.us-west-2.eks.amazonaws.com" -> (known after apply)
          ~ "name"                       = "ml-platform-dev" -> (known after apply)
          ~ "service_cidr"               = "172.20.0.0/16" -> (known after apply)
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.networking.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "us-west-2"
      + tags                 = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-us-west-2a"
        }
      + tags_all             = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-us-west-2a"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
    }

  # module.networking.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-west-2"
      + tags     = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc"
        }
      + tags_all = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_id   = "vpc-0bc0f1b3d869d4a7e"
    }

  # module.networking.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "us-west-2"
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-us-west-2a"
        }
      + tags_all                           = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-us-west-2a"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
    }

  # module.networking.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-west-2"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.networking.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-west-2"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.networking.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-west-2"
      + route            = (known after apply)
      + tags             = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-private"
        }
      + tags_all         = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-private"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_id           = "vpc-0bc0f1b3d869d4a7e"
    }

  # module.networking.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-west-2"
      + route            = (known after apply)
      + tags             = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-public"
        }
      + tags_all         = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-public"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_id           = "vpc-0bc0f1b3d869d4a7e"
    }

  # module.networking.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-west-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-west-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-west-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-west-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-west-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-west-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-west-2"
      + tags                                           = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "Name"                                  = "ml-platform-dev-vpc-private-us-west-2a"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/internal-elb"       = "1"
        }
      + tags_all                                       = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "ManagedBy"                             = "Terraform"
          + "Name"                                  = "ml-platform-dev-vpc-private-us-west-2a"
          + "Owner"                                 = "wlevan3"
          + "Project"                               = "ml-platform-engineering-practicum"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/internal-elb"       = "1"
        }
      + vpc_id                                         = "vpc-0bc0f1b3d869d4a7e"
    }

  # module.networking.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-west-2"
      + tags                                           = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "Name"                                  = "ml-platform-dev-vpc-private-us-west-2b"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/internal-elb"       = "1"
        }
      + tags_all                                       = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "ManagedBy"                             = "Terraform"
          + "Name"                                  = "ml-platform-dev-vpc-private-us-west-2b"
          + "Owner"                                 = "wlevan3"
          + "Project"                               = "ml-platform-engineering-practicum"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/internal-elb"       = "1"
        }
      + vpc_id                                         = "vpc-0bc0f1b3d869d4a7e"
    }

  # module.networking.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-west-2"
      + tags                                           = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "Name"                                  = "ml-platform-dev-vpc-private-us-west-2c"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/internal-elb"       = "1"
        }
      + tags_all                                       = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "ManagedBy"                             = "Terraform"
          + "Name"                                  = "ml-platform-dev-vpc-private-us-west-2c"
          + "Owner"                                 = "wlevan3"
          + "Project"                               = "ml-platform-engineering-practicum"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/internal-elb"       = "1"
        }
      + vpc_id                                         = "vpc-0bc0f1b3d869d4a7e"
    }

  # module.networking.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-west-2"
      + tags                                           = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "Name"                                  = "ml-platform-dev-vpc-public-us-west-2a"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/elb"                = "1"
        }
      + tags_all                                       = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "ManagedBy"                             = "Terraform"
          + "Name"                                  = "ml-platform-dev-vpc-public-us-west-2a"
          + "Owner"                                 = "wlevan3"
          + "Project"                               = "ml-platform-engineering-practicum"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/elb"                = "1"
        }
      + vpc_id                                         = "vpc-0bc0f1b3d869d4a7e"
    }

  # module.networking.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-west-2"
      + tags                                           = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "Name"                                  = "ml-platform-dev-vpc-public-us-west-2b"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/elb"                = "1"
        }
      + tags_all                                       = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "ManagedBy"                             = "Terraform"
          + "Name"                                  = "ml-platform-dev-vpc-public-us-west-2b"
          + "Owner"                                 = "wlevan3"
          + "Project"                               = "ml-platform-engineering-practicum"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/elb"                = "1"
        }
      + vpc_id                                         = "vpc-0bc0f1b3d869d4a7e"
    }

  # module.networking.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-west-2"
      + tags                                           = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "Name"                                  = "ml-platform-dev-vpc-public-us-west-2c"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/elb"                = "1"
        }
      + tags_all                                       = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "ManagedBy"                             = "Terraform"
          + "Name"                                  = "ml-platform-dev-vpc-public-us-west-2c"
          + "Owner"                                 = "wlevan3"
          + "Project"                               = "ml-platform-engineering-practicum"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/elb"                = "1"
        }
      + vpc_id                                         = "vpc-0bc0f1b3d869d4a7e"
    }

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2023_x86_64_STANDARD"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = (known after apply)
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "ml-platform-dev-ng-"
      + node_role_arn          = "arn:aws:iam::984479408136:role/ml-platform-dev-ng-20251109234831515300000003"
      + region                 = "us-west-2"
      + release_version        = "1.34.2-20251209"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-ng"
        }
      + tags_all               = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-ng"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + version                = "1.34"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 4
          + min_size     = 1
        }

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for ml-platform-dev-ng EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "main-"
      + region                 = "us-west-2"
      + tags                   = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-worker-node"
        }
      + tags_all               = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-worker-node"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + update_default_version = true
      + vpc_security_group_ids = [
          + "sg-04464eed4a2edb62a",
        ]
        # (2 unchanged attributes hidden)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination      = "true"
              + encrypted                  = "true"
              + iops                       = (known after apply)
              + throughput                 = (known after apply)
              + volume_initialization_rate = (known after apply)
              + volume_size                = 30
              + volume_type                = "gp3"
            }
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = "enabled"
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Cluster"     = "ml-platform-dev"
              + "Environment" = "dev"
              + "Name"        = "ml-platform-dev-ng"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Cluster"     = "ml-platform-dev"
              + "Environment" = "dev"
              + "Name"        = "ml-platform-dev-ng"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Cluster"     = "ml-platform-dev"
              + "Environment" = "dev"
              + "Name"        = "ml-platform-dev-ng"
            }
        }
    }

Plan: 36 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ cluster_certificate_authority_data = (sensitive value)
  ~ cluster_endpoint                   = "https://6183887E9D57324A6160F8C248235ABC.gr7.us-west-2.eks.amazonaws.com" -> (known after apply)
  + cluster_id                         = (known after apply)
  + cluster_name                       = (known after apply)
  ~ oidc_provider_arn                  = "arn:aws:iam::984479408136:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/6183887E9D57324A6160F8C248235ABC" -> (known after apply)
  ~ private_subnet_ids                 = [
      ~ "subnet-0df1e4697248c3649" -> (known after apply),
      ~ "subnet-01a0a67d7af63e9c3" -> (known after apply),
      ~ "subnet-04b042dba5b15d3dd" -> (known after apply),
    ]
  ~ public_subnet_ids                  = [
      ~ "subnet-0d499d5c977654e28" -> (known after apply),
      ~ "subnet-0e51079c00abcde29" -> (known after apply),
      ~ "subnet-058dc1431ef95abc6" -> (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

**Event**: `pull_request`
**Run**: [#20227859693](https://github.com/wlevan3/ml-platform-engineering-practicum/actions/runs/20227859693)
**Analysis**: `✅ Complete`
